#ifndef MAZEWINDOW_H
#define MAZEWINDOW_H

#include <QJsonObject>
#include <QKeyEvent>
#include <QLabel>
#include <QMainWindow>
#include <QPushButton>
#include <QRandomGenerator>
#include <QShowEvent>
#include <QStandardPaths>

namespace Ui {
class MazeWindow;
}

class MazeWindow : public QMainWindow
{
   Q_OBJECT

public:
   explicit MazeWindow(QWidget *parent = nullptr);
   ~MazeWindow();
   Ui::MazeWindow *ui;
   QVector<QString> ItemPixmaps{"://image/item1_Case.png", "://image/item2_Case.png", "://image/item3_Case.png"};
   QRandomGenerator *randomGenerator = QRandomGenerator::global();
   struct item
   {
      QString name;
      QString photo;
      bool isCase = false;
      float Float;
      int cost;
      int index;
   };
public slots:
   bool balanceChange(int value);
   void putInventory(QString photo, QString name, bool isCase, int cost, float Float = -1);
   void getInventory(int index);
private slots:
   void resizeEvent(QResizeEvent *event) override;
   void keyPressEvent(QKeyEvent *event) override;
   void closeEvent(QCloseEvent *event) override;
   void createMaze();
   void createWalls();
   void createWayMarker(short int id1, short int id2);
   bool isCollision(int x, int y, bool vertical);
   void createData();
   bool saveData();
   bool loadData();
   void checkRank();
   void update();
   void kill(short int id);

private:
   unsigned int maxCols;
   unsigned int maxRows;
   unsigned int errorCounter = 0;
   unsigned int maxId;
   struct cell
   {
      bool WasThere = false;
      bool Up = false;
      bool Left = false;
      bool Down = false;
      bool Right = false;
   };
   QVector<QPushButton *> Inventory;
   QVector<cell> Cell;
   QList<QLabel *> walls;
   QVector<item *> Items;
   const int step = 20;
   unsigned int markers = 0;
   double score;
   unsigned short int PlayerOffset = 2;

   //Data
   const QString filePath = QStandardPaths::writableLocation(QStandardPaths::DocumentsLocation) + "/Leksusmart Games/Maze_Case/data.json";
   QJsonObject data;

public:
   QMap<QString, QPair<QString, QList<QString>>> itemDetails = {
      //Case 1 Галерейный
      {"://image/item1_Common1.png", {"USP-S: 27", {"153", "56", "26", "18", "19"}}},
      {"://image/item1_Common2.png", {"Desert Eagle: Каллиграффити", {"179", "52", "26", "20", "16"}}},
      {"://image/item1_Common3.png", {"MP5-SD: Статика", {"94", "54", "23", "16", "14"}}},
      {"://image/item1_Common4.png", {"AUG: Роскошная отделка", {"154", "63", "23", "22", "15"}}},
      {"://image/item1_Common5.png", {"M249: Гипнотизёр", {"100", "53", "22", "14", "14"}}},
      {"://image/item1_Common6.png", {"Револьвер R8: Танго", {"113", "52", "23", "22", "14"}}},
      {"://image/item1_Common7.png", {"SCAR-20: Первопроходец", {"86", "54", "23", "17", "17"}}},
      {"://image/item1_Rare1.png", {"M4A4: Турбина", {"780", "388", "188", "168", "129"}}},
      {"://image/item1_Rare2.png", {"Dual Berettas: Гидрострелы", {"701", "376", "184", "169", "128"}}},
      {"://image/item1_Rare3.png", {"MAC-10: Сайба о́ни", {"652", "385", "205", "185", "161"}}},
      {"://image/item1_Rare4.png", {"P90: Резвый Рэнди", {"643", "373", "182", "167", "122"}}},
      {"://image/item1_Rare5.png", {"SSG 08: Метрополитен", {"669", "385", "185", "171", "119"}}},
      {"://image/item1_VeryRare1.png", {"AK-47: Дилетанты", {"12029", "5346", "2446", "1851", "1380"}}},
      {"://image/item1_VeryRare2.png", {"P250: Эпицентр", {"2571", "1695", "975", "954", "773"}}},
      {"://image/item1_VeryRare3.png", {"UMP-45 : Неонуар", {"2786", "1744", "986", "792", "822"}}},
      {"://image/item1_Secret1.png", {"Glock-18: Золотой зубок", {"11257", "5682", "2719", "2546", "1979"}}},
      {"://image/item1_Secret2.png", {"M4A1-S: Вейпорвейв", {"31841", "19607", "13455", "11150", "8739"}}},
      {"://image/item1_Legend.png", {"Кукри", {"", "", "", "", ""}}},
      {"://image/item1_Legend1.png", {"Кукри: Северный лес", {"26113", "21083", "17372", "17805", "17496"}}},
      {"://image/item1_Legend2.png", {"Кукри: Пиксельный камуфляж «Лес»", {"34084", "21581", "18361", "17829", "16834"}}},
      {"://image/item1_Legend3.png", {"Кукри: Сажа", {"32945", "24818", "18090", "21440", "22226"}}},
      {"://image/item1_Legend4.png", {"Кукри: Городская маскировка", {"36445", "25695", "18762", "18310", "20005"}}},
      {"://image/item1_Legend5.png", {"Кукри: Ночная полоса", {"47714", "27528", "20187", "20975", "19113"}}},
      {"://image/item1_Legend6.png", {"Кукри: Патина", {"37755", "29890", "28462", "23955", "23010"}}},
      {"://image/item1_Legend7.png", {"Кукри: Вороненая сталь", {"78658", "37874", "35610", "31463", "29438"}}},
      {"://image/item1_Legend8.png", {"Кукри: Поверхностная закалка", {"86216", "43431", "37508", "32196", "34599"}}},
      {"://image/item1_Legend9.png", {"Кукри: Vanilla", {"49489Е", "49489", "49489", "49489", "49489"}}},
      {"://image/item1_Legend10.png", {"Кукри: Кровавая паутина", {"194229", "59674", "39570", "33166", "25170"}}},
      {"://image/item1_Legend11.png", {"Кукри: Убийство", {"58017", "52227", "61876", "-1", "-1"}}},
      {"://image/item1_Legend12.png", {"Кукри: Градиент", {"84424", "83900", "-1", "-1", "-1"}}},
      {"://image/item1_Legend13.png", {"Кукри: Африканская сетка", {"29628", "18344", "17481", "17148", "18353"}}},
      //Ключ платишь за шо если закрыл
      //Case 2 Грёзы и кошмары
      {"://image/item2_Common1.png", {"Five-SeveN: Каракули", {"44", "13", "7", "6", "6"}}},
      {"://image/item2_Common2.png", {"MAC-10: Заточение", {"40", "14", "6", "7", "6"}}},
      {"://image/item2_Common3.png", {"MAG-7: Предсказание", {"28", "13", "6", "7", "7"}}},
      {"://image/item2_Common4.png", {"MP5-SD: Юный некромант", {"36", "14", "6", "6", "7"}}},
      {"://image/item2_Common5.png", {"P2000: Поднятие духов", {"33", "13", "6", "7", "7"}}},
      {"://image/item2_Common6.png", {"SCAR-20: Экзорцыпа", {"27", "13", "6", "7", "6"}}},
      {"://image/item2_Common7.png", {"Sawed-Off: Спиритическая доска", {"32", "12", "6", "6", "7"}}},
      {"://image/item2_Rare1.png", {"ПП-19 «Бизон»: Космокот", {"185", "96", "41", "45", "40"}}},
      {"://image/item2_Rare2.png", {"G3SG1: Поляна грёз", {"204", "88", "40", "37", "40"}}},
      {"://image/item2_Rare3.png", {"M4A1-S: Ночной ужас", {"254", "115", "68", "119", "200"}}},
      {"://image/item2_Rare4.png", {"XM1014: Зомби-страйк", {"177", "86", "41", "44", "44"}}},
      {"://image/item2_Rare5.png", {"USP-S: Билет в ад", {"249", "116", "83", "97", "47"}}},
      {"://image/item2_VeryRare1.png", {"Dual Berettas: Плод воображения", {"1120", "427", "201", "165", "162"}}},
      {"://image/item2_VeryRare2.png", {"FAMAS: Быстрые движения глаз", {"1069", "417", "193", "170", "167"}}},
      {"://image/item2_VeryRare3.png", {"MP7: Дух бездны", {"1097", "416", "202", "175", "164"}}},
      {"://image/item2_Secret1.png", {"AK-47: Пожелание на ночь", {"7446", "2497", "1223", "977", "662"}}},
      {"://image/item2_Secret2.png", {"MP9: Звёздный защитник", {"2286", "883", "417", "442", "310"}}},
      {"://image/item2_Legend.png", {"", {"", "", "", "", ""}}},
      {"://image/item2_Legend1.png", {"Фальшион: Легенды", {"35658", "29237", "25359", "22915", "22915"}}},
      {"://image/item2_Legend2.png", {"Нож-бабочка: Легенды", {"220234", "209750", "169897", "153225", "128299"}}},
      {"://image/item2_Legend3.png", {"Тычковые ножи: Легенды", {"29135", "18344", "17410", "15621", "16025"}}},
      {"://image/item2_Legend4.png", {"Нож Боуи: Легенды", {"56856", "31832", "26526", "23217", "20555"}}},
      {"://image/item2_Legend5.png", {"Охотничий нож: Легенды", {"43002", "32970", "26533", "26800", "20503"}}},
      {"://image/item2_Legend6.png", {"Фальшион: Черный глянец", {"29457", "18119", "18002", "16764", "17250"}}},
      {"://image/item2_Legend7.png", {"Нож-бабочка: Черный глянец", {"159874", "144841", "137570", "128838", "123583"}}},
      {"://image/item2_Legend8.png", {"Тычковые ножи: Черный глянец", {"19200", "16277", "13487", "13164", "13850"}}},
      {"://image/item2_Legend9.png", {"Нож Боуи: Черный глянец", {"28560", "17265", "18005", "15917", "16131"}}},
      {"://image/item2_Legend10.png", {"Охотничий нож: Черный глянец", {"35799", "20816", "19100", "18675", "19646"}}},
      {"://image/item2_Legend11.png", {"Фальшион: Гамма-волны", {"54272", "58123", "-1", "-1", "-1"}}},
      {"://image/item2_Legend12.png", {"Нож-бабочка: Гамма-волны", {"209750", "209750", "-1", "-1", "-1"}}},
      {"://image/item2_Legend13.png", {"Тычковые ножи: Гамма-волны", {"26009", "26183", "-1", "-1", "-1"}}},
      {"://image/item2_Legend14.png", {"Нож Боуи: Гамма-волны", {"51214", "55142", "-1", "-1", "-1"}}},
      {"://image/item2_Legend15.png", {"Охотничий нож: Гамма-волны", {"60303", "80930", "-1", "-1", "-1"}}},
      {"://image/item2_Legend16.png", {"Фальшион: Автотроника", {"42578", "29101", "23388", "29257", "21830"}}},
      {"://image/item2_Legend17.png", {"Нож-бабочка: Автотроника", {"209750", "209750", "173876", "167077", "183330"}}},
      {"://image/item2_Legend18.png", {"Тычковые ножи: Автотроника", {"22460", "15945", "15008", "15334", "15798"}}},
      {"://image/item2_Legend19.png", {"Нож Боуи: Автотроника", {"35365", "27650", "24818", "28262", "22839"}}},
      {"://image/item2_Legend20.png", {"Охотничий нож: Автотроника", {"46564", "33768", "26545", "25066", "24150"}}},
      {"://image/item2_Legend21.png", {"Фальшион: Ручная роспись", {"26133", "21981", "19276", "19207", "17158"}}},
      {"://image/item2_Legend22.png", {"Нож-бабочка: Ручная роспись", {"158985", "149347", "149488", "139483", "98746"}}},
      {"://image/item2_Legend23.png", {"Тычковые ножи: Ручная роспись", {"16151", "15823", "14683", "14900", "15500"}}},
      {"://image/item2_Legend24.png", {"Нож Боуи: Ручная роспись", {"24000", "20556", "18935", "18885", "18668"}}},
      {"://image/item2_Legend25.png", {"Охотничий нож: Ручная роспись", {"22298", "20502", "18490", "21150", "17589"}}},
      {"://image/item2_Legend26.png", {"Фальшион: Чистая вода", {"22121", "19564", "17725", "19700", "17939"}}},
      {"://image/item2_Legend27.png", {"Нож-бабочка: Чистая вода", {"141581", "138697", "129936", "133769", "114575"}}},
      {"://image/item2_Legend28.png", {"Тычковые ножи: Чистая вода", {"14566", "14157", "14260", "15353", "13649"}}},
      {"://image/item2_Legend29.png", {"Нож Боуи: Чистая вода", {"19934", "17862", "16576", "17360", "21581"}}},
      {"://image/item2_Legend30.png", {"Охотничий нож: Чистая вода", {"20963", "19577", "16752", "18878", "17268"}}},
      //Case 3 Революция
      {"://image/item3_Common1.png", {"MAG-7: Бессонница", {"42", "15", "8", "7", "7"}}},
      {"://image/item3_Common2.png", {"MP9: Пушинка", {"50", "16", "7", "6", "7"}}},
      {"://image/item3_Common3.png", {"SCAR-20: Фрагменты", {"32", "15", "7", "8", "7"}}},
      {"://image/item3_Common4.png", {"P250: Ре.конструкция", {"37", "16", "7", "8", "7"}}},
      {"://image/item3_Common5.png", {"MP5-SD: Ликвидация", {"41", "16", "9", "7", "7"}}},
      {"://image/item3_Common6.png", {"SG 553: Киберсила", {"49", "15", "8", "7", "6"}}},
      {"://image/item3_Common7.png", {"Tec-9: Повстанец", {"40", "14", "6", "6", "7"}}},
      {"://image/item3_Rare1.png", {"M4A1-S: Эмфорозавр-S", {"385", "155", "60", "118", "65"}}},
      {"://image/item3_Rare2.png", {"Glock-18: Кролик в тени", {"242", "112", "53", "79", "48"}}},
      {"://image/item3_Rare3.png", {"MAC-10: Саккаку", {"-1", "-1", "111", "52", "42"}}},
      {"://image/item3_Rare4.png", {"Револьвер R8: Банановая пушка", {"250", "99", "48", "41", "43"}}},
      {"://image/item3_Rare5.png", {"P90: Неокоролева", {"202", "100", "51", "51", "51"}}},
      {"://image/item3_VeryRare1.png", {"AWP: Двойственность", {"1515", "766", "291", "356", "257"}}},
      {"://image/item3_VeryRare2.png", {"UMP-45: Дикое дитя", {"1457", "588", "233", "190", "181"}}},
      {"://image/item3_VeryRare3.png", {"P2000: Сорвиголова", {"1687", "588", "233", "183", "179"}}},
      {"://image/item3_Secret1.png", {"M4A4: Темукау", {"14913", "5772", "1442", "1378", "856"}}},
      {"://image/item3_Secret2.png", {"AK-47: Выстрел в голову", {"7481", "2404", "1353", "842", "713"}}},
      {"://image/item3_Legend.png", {"Перчатки", {"", "", "", "", ""}}},
      {"://image/item3_Legend1.png", {"Перчатки «Гидра»: Изумруд", {"51799", "14538", "11000", "10532", "9496"}}},
      {"://image/item3_Legend2.png", {"Перчатки «Гидра»: Поверхностная закалка", {"136432", "24739", "15314", "15511", "15000"}}},
      {"://image/item3_Legend3.png", {"Перчатки «Гидра»: Гремучая змея", {"32484", "12399", "8525", "9600", "8753"}}},
      {"://image/item3_Legend4.png", {"Перчатки «Гидра»: Мангры", {"100938", "13634", "9148", "11500", "9176"}}},
      {"://image/item3_Legend5.png", {"Водительские перчатки: Гоночный зелёный", {"58179", "15352", "9819", "9556", "9367"}}},
      {"://image/item3_Legend6.png", {"Водительские перчатки: Обгон", {"83900", "23273", "15511", "14157", "11870"}}},
      {"://image/item3_Legend7.png", {"Водительские перчатки: Королевский змей", {"211829", "188775", "47478", "39656", "26217"}}},
      {"://image/item3_Legend8.png", {"Водительские перчатки: Имперская клетка", {"166372", "100352", "44300", "42190", "31022"}}},
      {"://image/item3_Legend9.png", {"Обмотки рук: Скотч", {"52438", "16104", "12949", "12302", "12060"}}},
      {"://image/item3_Legend10.png", {"Обмотки рук: Синие черепа", {"209750", "136208", "57050", "49636", "58896"}}},
      {"://image/item3_Legend11.png", {"Обмотки рук: Оттиск", {"142223", "44584", "28585", "27792", "17148"}}},
      {"://image/item3_Legend12.png", {"Обмотки рук: Лес", {"35610", "18898", "15074", "14143", "11810"}}},
      {"://image/item3_Legend13.png", {"Мотоциклетные перчатки: Транспорт", {"72362", "21605", "13500", "11896", "10681"}}},
      {"://image/item3_Legend14.png", {"Мотоциклетные перчатки: Полигон", {"161858", "42212", "26711", "24478", "16781"}}},
      {"://image/item3_Legend15.png", {"Мотоциклетные перчатки: БУХ!", {"153444", "85804", "27792", "21332", "15108"}}},
      {"://image/item3_Legend16.png", {"Мотоциклетные перчатки: Черепаха", {"161858", "35610", "18420", "16643", "15634"}}},
      {"://image/item3_Legend17.png", {"Перчатки спецназа: Градиент", {"209750", "161858", "51448", "47262", "25741"}}},
      {"://image/item3_Legend18.png", {"Перчатки спецназа: Дробь", {"52982", "19147", "13056", "12657", "11898"}}},
      {"://image/item3_Legend19.png", {"Перчатки спецназа: Кровавая паутина", {"203533", "96484", "35082", "31643", "22022"}}},
      {"://image/item3_Legend20.png", {"Перчатки спецназа: Покоритель гор", {"115363", "44294", "23739", "21829", "19193"}}},
      {"://image/item3_Legend21.png", {"Спортивные перчатки: Окисление бронзы", {"188775", "32114", "19899", "18422", "16510"}}},
      {"://image/item3_Legend22.png", {"Спортивные перчатки: Амфибия", {"209750", "183539", "101205", "96000", "66362"}}},
      {"://image/item3_Legend23.png", {"Спортивные перчатки: Порок", {"211829", "221673", "165179", "116259", "73412"}}},
      {"://image/item3_Legend24.png", {"Спортивные перчатки: Омега", {"213023", "157313", "59144", "49671", "33985"}}},

      /*
      {"://image/item2_Common1.png", {"", {"", "", "", "", ""}}},
      {"://image/item4_Common2.png", {"", {"", "", "", "", ""}}},
      {"://image/item4_Common3.png", {"", {"", "", "", "", ""}}},
      {"://image/item4_Common4.png", {"", {"", "", "", "", ""}}},
      {"://image/item4_Common5.png", {"", {"", "", "", "", ""}}},
      {"://image/item4_Common6.png", {"", {"", "", "", "", ""}}},
      {"://image/item4_Common7.png", {"", {"", "", "", "", ""}}},
      {"://image/item4_Rare1.png", {"", {"", "", "", "", ""}}},
      {"://image/item4_Rare2.png", {"", {"", "", "", "", ""}}},
      {"://image/item4_Rare3.png", {"", {"", "", "", "", ""}}},
      {"://image/item4_Rare4.png", {"", {"", "", "", "", ""}}},
      {"://image/item4_Rare5.png", {"", {"", "", "", "", ""}}},
      {"://image/item4_VeryRare1.png", {"", {"", "", "", "", ""}}},
      {"://image/item4_VeryRare2.png", {"", {"", "", "", "", ""}}},
      {"://image/item4_VeryRare3.png", {"", {"", "", "", "", ""}}},
      {"://image/item4_Secret1.png", {"", {"", "", "", "", ""}}},
      {"://image/item4_Secret2.png", {"", {"", "", "", "", ""}}},
      {"://image/item4_Legend.png", {"", {"", "", "", "", ""}}},
      */
   };
};

#endif // MAZEWINDOW_H
