#ifndef MAZEWINDOW_H
#define MAZEWINDOW_H

#include <QJsonObject>
#include <QKeyEvent>
#include <QLabel>
#include <QMainWindow>
#include <QPushButton>
#include <QRandomGenerator>
#include <QShowEvent>
#include <QStandardPaths>

#include <QNetworkAccessManager>
namespace Ui {
class MazeWindow;
}

class MazeWindow : public QMainWindow
{
   Q_OBJECT

public:
   explicit MazeWindow(QWidget *parent = nullptr);
   ~MazeWindow();
   Ui::MazeWindow *ui;
   QRandomGenerator *randomGenerator = QRandomGenerator::global();
   struct item
   {
      QString name;
      QString photo;
      bool isCase = false;
      float Float;
      double cost;
   };
public slots:
   bool balanceChange(double value);
   void putInventory(QString photo, QString name, bool isCase, int cost, float Float = -1, bool isDev = false);
   void getInventory(int index, bool isDev = false);
private slots:
   void resizeEvent(QResizeEvent *event) override;
   void keyPressEvent(QKeyEvent *event) override;
   void closeEvent(QCloseEvent *event) override;
   void moveEvent(QMoveEvent *event) override;
   void updatePrice(MazeWindow::item item);
   void createMaze();
   void createWalls();
   void createWayMarker(short int id1, short int id2);
   bool isCollision(int x, int y, bool vertical);
   void createData();
   bool saveData();
   bool loadData();
   void checkRank();
   void update();
   void kill(short int id);

private:
   unsigned int maxCols;
   unsigned int maxRows;
   unsigned int errorCounter = 0;
   unsigned int maxId;
   struct cell
   {
      bool WasThere = false;
      bool Up = false;
      bool Left = false;
      bool Down = false;
      bool Right = false;
   };
   QVector<QPushButton *> Inventory;
   QVector<QPushButton *> InventoryDev;
   QVector<cell> Cell;
   QList<QLabel *> walls;
   QVector<item *> Items;
   const int step = 20;
   unsigned int markers = 0;
   double score;
   unsigned short int PlayerOffset = 2;

   //Data
   const QString filePath = QStandardPaths::writableLocation(QStandardPaths::AppLocalDataLocation).section('/', 0, -2) + "/Leksusmart Games/Maze Case/data.json";
   QJsonObject data;

public:
   QNetworkAccessManager *networkManager;
   struct ItemDetail
   {
      QString source;
      QString nameEng;
      QString name;
      QList<QString> cost;
      QList<QString> steamID;
   };

   QList<ItemDetail> itemDetails = {
      //Сами кейсы:
      {"://image/item1_Case.png", "Gallery Case", "Галерейный Кейс", {"100"}, {"176460428"}},
      {"://image/item2_Case.png", "Dreams & Nightmares Case", "Кейс «Грёзы и кошмары»", {"198"}, {"176288467"}},
      {"://image/item3_Case.png", "Revolution Case", "Кейс «Революция»", {"61"}, {"176358765"}},
      //Case 1 Галерейный
      {"://image/item1_Common1.png", "USP-S | 27", "USP-S: 27", {"153", "56", "26", "18", "19"}, {"176460656", "176460461", "176460629", "176460493", "176460782"}},
      {"://image/item1_Common2.png", "Desert Eagle | Calligraffiti", "Desert Eagle: Каллиграффити", {"179", "52", "26", "20", "16"}, {"176460693", "176460647", "176460517", "176460639", "176460561"}},
      {"://image/item1_Common3.png", "MP5-SD | Statics", "MP5-SD: Статика", {"94", "54", "23", "16", "14"}, {"176460886", "176460699", "176460635", "176460692", "176460773"}},
      {"://image/item1_Common4.png", "AUG | Luxe Trim", "AUG: Роскошная отделка", {"154", "63", "23", "22", "15"}, {"176460825", "176460576", "176460431", "176460481", "176460550"}},
      {"://image/item1_Common5.png", "M249 | Hypnosis", "M249: Гипнотизёр", {"100", "53", "22", "14", "14"}, {"176460759", "176460749", "176460598", "176460723", "176460769"}},
      {"://image/item1_Common6.png", "R8 Revolver | Tango", "Револьвер R8: Танго", {"113", "52", "23", "22", "14"}, {"176460721", "176460480", "176460455", "176460882", "176460631"}},
      {"://image/item1_Common7.png", "SCAR-20 | Trail Blazer", "SCAR-20: Первопроходец", {"86", "54", "23", "17", "17"}, {"176460665", "176460520", "176460507", "176460935", "176460704"}},
      {"://image/item1_Rare1.png", "M4A4 | Turbine", "M4A4: Турбина", {"780", "388", "188", "168", "129"}, {"176460851", "176460672", "176460630", "176460617", "176460504"}},
      {"://image/item1_Rare2.png", "Dual Berettas | Hydro Strike", "Dual Berettas: Гидрострелы", {"701", "376", "184", "169", "128"}, {"176460580", "176460698", "176460535", "176461002", "176460684"}},
      {"://image/item1_Rare3.png", "MAC-10 | Saibā Oni", "MAC-10: Сайба о́ни", {"652", "385", "205", "185", "161"}, {"176460766", "176460615", "176460610", "176460736", "176460799"}},
      {"://image/item1_Rare4.png", "P90 | Randy Rush", "P90: Резвый Рэнди", {"643", "373", "182", "167", "122"}, {"176460527", "176460637", "176460575", "176460833", "176460804"}},
      {"://image/item1_Rare5.png", "SSG 08 | Rapid Transit", "SSG 08: Метрополитен", {"669", "385", "185", "171", "119"}, {"176460763", "176460568", "176460597", "176460849", "176460569"}},
      {"://image/item1_VeryRare1.png", "AK-47 | The Outsiders", "AK-47: Дилетанты", {"12029", "5346", "2446", "1851", "1380"}, {"176460679", "176460558", "176460577", "176460741", "176460524"}},
      {"://image/item1_VeryRare2.png", "P250 | Epicenter", "P250: Эпицентр", {"2571", "1695", "975", "954", "773"}, {"176460807", "176460689", "176460487", "176460775", "176460660"}},
      {"://image/item1_VeryRare3.png", "UMP-45 | Neo-Noir", "UMP-45 : Неонуар", {"2786", "1744", "986", "792", "822"}, {"176460728", "176460755", "176460690", "176460589", "176460774"}},
      {"://image/item1_Secret1.png", "Glock-18 | Gold Toof", "Glock-18: Золотой зубок", {"11257", "5682", "2719", "2546", "1979"}, {"176460816", "176460433", "176460519", "176460907", "176460478"}},
      {"://image/item1_Secret2.png", "M4A1-S | Vaporwave", "M4A1-S: Вейпорвейв", {"31841", "19607", "13455", "11150", "8739"}, {"176460720", "176460548", "176460555", "176460661", "176460796"}},
      {"://image/item1_Legend.png", "", "", {"-1", "-1", "-1", "-1", "-1"}, {"-1", "-1", "-1", "-1", "-1"}},
      {"://image/item1_Legend1.png",
       "★ Kukri Knife | Boreal Forest",
       "Кукри: Северный лес",
       {"26113", "21083", "17372", "17805", "17496"},
       {"176414421", "176414194", "176414226", "176414258", "176414184"}},
      {"://image/item1_Legend2.png",
       "★ Kukri Knife | Forest DDPAT",
       "Кукри: Пиксельный камуфляж «Лес»",
       {"34084", "21581", "18361", "17829", "16834"},
       {"176418955", "176414276", "176414169", "176414230", "176414257"}},
      {"://image/item1_Legend3.png", "★ Kukri Knife | Scorched", "Кукри: Сажа", {"32945", "24818", "18090", "21440", "22226"}, {"176414569", "176414151", "176414157", "176414299", "176414176"}},
      {"://image/item1_Legend4.png",
       "★ Kukri Knife | Urban Masked",
       "Кукри: Городская маскировка",
       {"36445", "25695", "18762", "18310", "20005"},
       {"176415147", "176414178", "176414171", "176414209", "176414242"}},
      {"://image/item1_Legend5.png",
       "★ Kukri Knife | Night Stripe",
       "Кукри: Ночная полоса",
       {"47714", "27528", "20187", "20975", "19113"},
       {"176420350", "176414205", "176414204", "176414181", "176414255"}},
      {"://image/item1_Legend6.png", "★ Kukri Knife | Stained", "Кукри: Патина", {"37755", "29890", "28462", "23955", "23010"}, {"176414331", "176414238", "176414126", "176414217", "176414289"}},
      {"://image/item1_Legend7.png",
       "★ Kukri Knife | Blue Steel",
       "Кукри: Вороненая сталь",
       {"78658", "37874", "35610", "31463", "29438"},
       {"176415464", "176414193", "176414179", "176414225", "176414233"}},
      {"://image/item1_Legend8.png",
       "★ Kukri Knife | Case Hardened",
       "Кукри: Поверхностная закалка",
       {"86216", "43431", "37508", "32196", "34599"},
       {"176414869", "176414170", "176414236", "176414163", "176414241"}},
      {"://image/item1_Legend9.png", "★ Kukri Knife", "Кукри: Vanilla", {"49489", "49489", "49489", "49489", "49489"}, {"176414196", "176414196", "176414196", "176414196", "176414196"}},
      {"://image/item1_Legend10.png",
       "★ Kukri Knife | Crimson Web",
       "Кукри: Кровавая паутина",
       {"194229", "59674", "39570", "33166", "25170"},
       {"176425583", "176414283", "176414287", "176414325", "176414177"}},
      {"://image/item1_Legend11.png", "★ Kukri Knife | Slaughter", "Кукри: Убийство", {"58017", "52227", "61876", "-1", "-1"}, {"176414206", "176414153", "176414260", "-1", "-1"}},
      {"://image/item1_Legend12.png", "★ Kukri Knife | Fade", "Кукри: Градиент", {"84424", "83900", "-1", "-1", "-1"}, {"176414256", "176414947", "-1", "-1", "-1"}},
      {"://image/item1_Legend13.png",
       "★ Kukri Knife | Safari Mesh",
       "Кукри: Африканская сетка",
       {"29628", "18344", "17481", "17148", "18353"},
       {"176414950", "176414216", "176414085", "176414335", "176414214"}},
      //Case 2 Грёзы и кошмары
      {"://image/item2_Common1.png", "Five-SeveN | Scrawl", "Five-SeveN: Каракули", {"44", "13", "7", "6", "6"}, {"176288522", "176288491", "176288493", "176288499", "176288494"}},
      {"://image/item2_Common2.png", "MAC-10 | Ensnared", "MAC-10: Заточение", {"40", "14", "6", "7", "6"}, {"176288537", "176288528", "176288490", "176288523", "176288583"}},
      {"://image/item2_Common3.png", "MAG-7 | Foresight", "MAG-7: Предсказание", {"28", "13", "6", "7", "7"}, {"176288488", "176288481", "176288477", "176288506", "176288533"}},
      {"://image/item2_Common4.png", "MP5-SD | Necro Jr.", "MP5-SD: Юный некромант", {"36", "14", "6", "6", "7"}, {"176288546", "176288517", "176288476", "176288503", "176288473"}},
      {"://image/item2_Common5.png", "P2000 | Lifted Spirits", "P2000: Поднятие духов", {"33", "13", "6", "7", "7"}, {"176288566", "176288475", "176288505", "176288489", "176288500"}},
      {"://image/item2_Common6.png", "SCAR-20 | Poultrygeist", "SCAR-20: Экзорцыпа", {"27", "13", "6", "7", "6"}, {"176288480", "176288492", "176288471", "176288484", "176288557"}},
      {"://image/item2_Common7.png", "Sawed-Off | Spirit Board", "Sawed-Off: Спиритическая доска", {"32", "12", "6", "6", "7"}, {"176288568", "176288510", "176288497", "176288521", "176288513"}},
      {"://image/item2_Rare1.png", "PP-Bizon | Space Cat", "ПП-19 «Бизон»: Космокот", {"185", "96", "41", "45", "40"}, {"176288524", "176288496", "176288516", "176288585", "176288512"}},
      {"://image/item2_Rare2.png", "G3SG1 | Dream Glade", "G3SG1: Поляна грёз", {"204", "88", "40", "37", "40"}, {"176288598", "176288498", "176288479", "176288526", "176288504"}},
      {"://image/item2_Rare3.png", "M4A1-S | Night Terror", "M4A1-S: Ночной ужас", {"254", "115", "68", "119", "200"}, {"176288570", "176288478", "176288520", "176288651", "176288474"}},
      {"://image/item2_Rare4.png", "XM1014 | Zombie Offensive", "XM1014: Зомби-страйк", {"177", "86", "41", "44", "44"}, {"176288514", "176288487", "176288502", "176288600", "176288616"}},
      {"://image/item2_Rare5.png", "USP-S | Ticket to Hell", "USP-S: Билет в ад", {"249", "116", "83", "97", "47"}, {"176288567", "176288485", "176288525", "176288486", "176288534"}},
      {"://image/item2_VeryRare1.png",
       "Dual Berettas | Melondrama",
       "Dual Berettas: Плод воображения",
       {"1120", "427", "201", "165", "162"},
       {"176288630", "176288536", "176288529", "176288584", "176288601"}},
      {"://image/item2_VeryRare2.png",
       "FAMAS | Rapid Eye Movement",
       "FAMAS: Быстрые движения глаз",
       {"1069", "417", "193", "170", "167"},
       {"176288632", "176288541", "176288551", "176288495", "176288573"}},
      {"://image/item2_VeryRare3.png", "MP7 | Abyssal Apparition", "MP7: Дух бездны", {"1097", "416", "202", "175", "164"}, {"176288539", "176288544", "176288509", "176288470", "176288619"}},
      {"://image/item2_Secret1.png", "AK-47 | Nightwish", "AK-47: Пожелание на ночь", {"7446", "2497", "1223", "977", "662"}, {"176288668", "176288589", "176288571", "176288618", "176288611"}},
      {"://image/item2_Secret2.png", "MP9 | Starlight Protector", "MP9: Звёздный защитник", {"2286", "883", "417", "442", "310"}, {"176288559", "176288627", "176288507", "176288654", "176288664"}},
      {"://image/item2_Legend.png", "", "", {"-1", "-1", "-1", "-1", "-1"}, {"-1", "-1", "-1", "-1", "-1"}},
      {"://image/item2_Legend1.png", "★ Falchion Knife | Lore", "Фальшион: Легенды", {"35658", "29237", "25359", "22915", "22915"}, {"176263421", "176262938", "176263225", "176263314", "176263429"}},
      {"://image/item2_Legend2.png",
       "★ Butterfly Knife | Lore",
       "Нож-бабочка: Легенды",
       {"220234", "209750", "169897", "153225", "128299"},
       {"176277869", "176264272", "176263210", "176263278", "176263213"}},
      {"://image/item2_Legend3.png",
       "★ Shadow Daggers | Lore",
       "Тычковые ножи: Легенды",
       {"29135", "18344", "17410", "15621", "16025"},
       {"176263281", "176263165", "176263220", "176263198", "176263408"}},
      {"://image/item2_Legend4.png", "★ Bowie Knife | Lore", "Нож Боуи: Легенды", {"56856", "31832", "26526", "23217", "20555"}, {"176263262", "176263226", "176263189", "176263119", "176263311"}},
      {"://image/item2_Legend5.png",
       "★ Huntsman Knife | Lore",
       "Охотничий нож: Легенды",
       {"43002", "32970", "26533", "26800", "20503"},
       {"176263322", "176263264", "176263194", "176263244", "176263263"}},
      {"://image/item2_Legend6.png",
       "★ Falchion Knife | Black Laminate",
       "Фальшион: Черный глянец",
       {"29457", "18119", "18002", "16764", "17250"},
       {"176263553", "176263057", "176263173", "176263308", "176263216"}},
      {"://image/item2_Legend7.png",
       "★ Butterfly Knife | Black Laminate",
       "Нож-бабочка: Черный глянец",
       {"159874", "144841", "137570", "128838", "123583"},
       {"176263579", "176263282", "176263256", "176262929", "176263295"}},
      {"://image/item2_Legend8.png",
       "★ Shadow Daggers | Black Laminate",
       "Тычковые ножи: Черный глянец",
       {"19200", "16277", "13487", "13164", "13850"},
       {"176263425", "176263267", "176263187", "176263182", "176263348"}},
      {"://image/item2_Legend9.png",
       "★ Bowie Knife | Black Laminate",
       "Нож Боуи: Черный глянец",
       {"28560", "17265", "18005", "15917", "16131"},
       {"176263461", "176263190", "176263276", "176263195", "176263219"}},
      {"://image/item2_Legend10.png",
       "★ Huntsman Knife | Black Laminate",
       "Охотничий нож: Черный глянец",
       {"35799", "20816", "19100", "18675", "19646"},
       {"176263426", "176263239", "176263208", "176263268", "176263272"}},
      {"://image/item2_Legend11.png", "★ Falchion Knife | Gamma Doppler", "Фальшион: Гамма-волны", {"54272", "58123", "-1", "-1", "-1"}, {"176263139", "176263287", "-1", "-1", "-1"}},
      {"://image/item2_Legend12.png", "★ Butterfly Knife | Gamma Doppler", "Нож-бабочка: Гамма-волны", {"209750", "209750", "-1", "-1", "-1"}, {"176263372", "176264349", "-1", "-1", "-1"}},
      {"://image/item2_Legend13.png", "★ Shadow Daggers | Gamma Doppler", "Тычковые ножи: Гамма-волны", {"26009", "26183", "-1", "-1", "-1"}, {"176263201", "176263411", "-1", "-1", "-1"}},
      {"://image/item2_Legend14.png", "★ Bowie Knife | Gamma Doppler", "Нож Боуи: Гамма-волны", {"51214", "55142", "-1", "-1", "-1"}, {"176263223", "176263556", "-1", "-1", "-1"}},
      {"://image/item2_Legend15.png", "★ Huntsman Knife | Gamma Doppler", "Охотничий нож: Гамма-волны", {"60303", "80930", "-1", "-1", "-1"}, {"176263098", "176263445", "-1", "-1", "-1"}},
      {"://image/item2_Legend16.png",
       "★ Falchion Knife | Autotronic",
       "Фальшион: Автотроника",
       {"42578", "29101", "23388", "29257", "21830"},
       {"176263260", "176263320", "176263140", "176263693", "176263212"}},
      {"://image/item2_Legend17.png",
       "★ Butterfly Knife | Autotronic",
       "Нож-бабочка: Автотроника",
       {"209750", "209750", "173876", "167077", "183330"},
       {"176280144", "176263274", "176263175", "176263470", "176263381"}},
      {"://image/item2_Legend18.png",
       "★ Shadow Daggers | Autotronic",
       "Тычковые ножи: Автотроника",
       {"22460", "15945", "15008", "15334", "15798"},
       {"176263279", "176263313", "176263199", "176263402", "176263252"}},
      {"://image/item2_Legend19.png",
       "★ Bowie Knife | Autotronic",
       "Нож Боуи: Автотроника",
       {"35365", "27650", "24818", "28262", "22839"},
       {"176263285", "176263236", "176263193", "176263323", "176263325"}},
      {"://image/item2_Legend20.png",
       "★ Huntsman Knife | Autotronic",
       "Охотничий нож: Автотроника",
       {"46564", "33768", "26545", "25066", "24150"},
       {"176263403", "176263378", "176263215", "176263162", "176263202"}},
      {"://image/item2_Legend21.png",
       "★ Falchion Knife | Freehand",
       "Фальшион: Ручная роспись",
       {"26133", "21981", "19276", "19207", "17158"},
       {"176263291", "176263326", "176262942", "176263206", "176263240"}},
      {"://image/item2_Legend22.png",
       "★ Butterfly Knife | Freehand",
       "Нож-бабочка: Ручная роспись",
       {"158985", "149347", "149488", "139483", "98746"},
       {"176263248", "176263306", "176263246", "176263370", "176263386"}},
      {"://image/item2_Legend23.png",
       "★ Shadow Daggers | Freehand",
       "Тычковые ножи: Ручная роспись",
       {"16151", "15823", "14683", "14900", "15500"},
       {"176263301", "176263243", "176263141", "176263482", "176263494"}},
      {"://image/item2_Legend24.png",
       "★ Bowie Knife | Freehand",
       "Нож Боуи: Ручная роспись",
       {"24000", "20556", "18935", "18885", "18668"},
       {"176263056", "176263196", "176263197", "176263343", "176264127"}},
      {"://image/item2_Legend25.png",
       "★ Huntsman Knife | Freehand",
       "Охотничий нож: Ручная роспись",
       {"22298", "20502", "18490", "21150", "17589"},
       {"176263163", "176263259", "176263200", "176263294", "176263466"}},
      {"://image/item2_Legend26.png",
       "★ Falchion Knife | Bright Water",
       "Фальшион: Чистая вода",
       {"22121", "19564", "17725", "19700", "17939"},
       {"176263207", "176263172", "176263222", "176263467", "176263478"}},
      {"://image/item2_Legend27.png",
       "★ Butterfly Knife | Bright Water",
       "Нож-бабочка: Чистая вода",
       {"141581", "138697", "129936", "133769", "114575"},
       {"176263218", "176263247", "176263288", "176263217", "176263875"}},
      {"://image/item2_Legend28.png",
       "★ Shadow Daggers | Bright Water",
       "Тычковые ножи: Чистая вода",
       {"14566", "14157", "14260", "15353", "13649"},
       {"176263302", "176263286", "176263156", "176263418", "176263451"}},
      {"://image/item2_Legend29.png",
       "★ Bowie Knife | Bright Water",
       "Нож Боуи: Чистая вода",
       {"19934", "17862", "16576", "17360", "21581"},
       {"176263329", "176263008", "176263235", "176263453", "176263479"}},
      {"://image/item2_Legend30.png",
       "★ Huntsman Knife | Bright Water",
       "Охотничий нож: Чистая вода",
       {"20963", "19577", "16752", "18878", "17268"},
       {"176263149", "176262680", "176263204", "176263293", "176263894"}},
      //Case 3 Революция
      {"://image/item3_Common1.png", "MAG-7 | Insomnia", "MAG-7: Бессонница", {"42", "15", "8", "7", "7"}, {"176358885", "176358817", "176358790", "176358782", "176358798"}},
      {"://image/item3_Common2.png", "MP9 | Featherweight", "MP9: Пушинка", {"50", "16", "7", "6", "7"}, {"176358903", "176358812", "176358792", "176358795", "176358785"}},
      {"://image/item3_Common3.png", "SCAR-20 | Fragments", "SCAR-20: Фрагменты", {"32", "15", "7", "8", "7"}, {"176358831", "176358822", "176358788", "176358841", "176358806"}},
      {"://image/item3_Common4.png", "P250 | Re.built", "P250: Ре.конструкция", {"37", "16", "7", "8", "7"}, {"176358805", "176358815", "176358809", "176358823", "176358799"}},
      {"://image/item3_Common5.png", "MP5-SD | Liquidation", "MP5-SD: Ликвидация", {"41", "16", "9", "7", "7"}, {"176358929", "176358780", "176358794", "176358800", "176358833"}},
      {"://image/item3_Common6.png", "SG 553 | Cyberforce", "SG 553: Киберсила", {"49", "15", "8", "7", "6"}, {"176358827", "176358787", "176358786", "176358797", "176358802"}},
      {"://image/item3_Common7.png", "Tec-9 | Rebel", "Tec-9: Повстанец", {"40", "14", "6", "6", "7"}, {"176358827", "176358787", "176358786", "176358797", "176358810"}},
      {"://image/item3_Rare1.png", "M4A1-S | Emphorosaur-S", "M4A1-S: Эмфорозавр-S", {"385", "155", "60", "118", "65"}, {"176358816", "176358779", "176358791", "176358906", "176358846"}},
      {"://image/item3_Rare2.png", "Glock-18 | Umbral Rabbit", "Glock-18: Кролик в тени", {"242", "112", "53", "79", "48"}, {"176358804", "176358814", "176358789", "176358864", "176358832"}},
      {"://image/item3_Rare3.png", "MAC-10 | Sakkaku", "MAC-10: Саккаку", {"-1", "-1", "111", "52", "42"}, {"-1", "-1", "176358829", "176358843", "176358820"}},
      {"://image/item3_Rare4.png", "R8 Revolver | Banana Cannon", "Револьвер R8: Банановая пушка", {"250", "99", "48", "41", "43"}, {"176358781", "176358836", "176358826", "176358863", "176358874"}},
      {"://image/item3_Rare5.png", "P90 | Neoqueen", "P90: Неокоролева", {"202", "100", "51", "51", "51"}, {"176358865", "176358842", "176358819", "176358904", "176358852"}},
      {"://image/item3_VeryRare1.png", "AWP | Duality", "AWP: Двойственность", {"1515", "766", "291", "356", "257"}, {"176359764", "176359766", "176359763", "176359774", "176359765"}},
      {"://image/item3_VeryRare2.png", "UMP-45 | Wild Child", "UMP-45: Дикое дитя", {"1457", "588", "233", "190", "181"}, {"176358892", "176358807", "176358839", "176358875", "176358860"}},
      {"://image/item3_VeryRare3.png", "P2000 | Wicked Sick", "P2000: Сорвиголова", {"1687", "588", "233", "183", "179"}, {"176358871", "176358879", "176358811", "176358853", "176358890"}},
      {"://image/item3_Secret1.png", "M4A4 | Temukau", "M4A4: Темукау", {"14913", "5772", "1442", "1378", "856"}, {"176358901", "176358913", "176358845", "176358937", "176358946"}},
      {"://image/item3_Secret2.png", "AK-47 | Head Shot", "AK-47: Выстрел в голову", {"7481", "2404", "1353", "842", "713"}, {"176358933", "176358850", "176358849", "176358868", "176358858"}},
      {"://image/item3_Legend.png", "", "", {"-1", "-1", "-1", "-1", "-1"}, {"-1", "-1", "-1", "-1", "-1"}},
      {"://image/item3_Legend1.png",
       "★ Hydra Gloves | Emerald",
       "Перчатки «Гидра»: Изумруд",
       {"51799", "14538", "11000", "10532", "9496"},
       {"175971359", "175967466", "175967181", "175967266", "175967562"}},
      {"://image/item3_Legend2.png",
       "★ Hydra Gloves | Case Hardened",
       "Перчатки «Гидра»: Поверхностная закалка",
       {"136432", "24739", "15314", "15511", "15000"},
       {"175986716", "175967347", "175967004", "175967494", "175967035"}},
      {"://image/item3_Legend3.png",
       "★ Hydra Gloves | Rattler",
       "Перчатки «Гидра»: Гремучая змея",
       {"32484", "12399", "8525", "9600", "8753"},
       {"175978889", "175967076", "175966953", "175968206", "175967235"}},
      {"://image/item3_Legend4.png",
       "★ Hydra Gloves | Mangrove",
       "Перчатки «Гидра»: Мангры",
       {"100938", "13634", "9148", "11500", "9176"},
       {"175970327", "175967248", "175966981", "175967359", "175967193"}},
      {"://image/item3_Legend5.png",
       "★ Driver Gloves | Racing Green",
       "Водительские перчатки: Гоночный зелёный",
       {"58179", "15352", "9819", "9556", "9367"},
       {"175990024", "175967244", "175967075", "175967442", "175967012"}},
      {"://image/item3_Legend6.png",
       "★ Driver Gloves | Overtake",
       "Водительские перчатки: Обгон",
       {"83900", "23273", "15511", "14157", "11870"},
       {"175980217", "175967433", "175967141", "175966966", "175966935"}},
      {"://image/item3_Legend7.png",
       "★ Driver Gloves | King Snake",
       "Водительские перчатки: Королевский змей",
       {"211829", "188775", "47478", "39656", "26217"},
       {"175977497", "175966805", "175967213", "175967471", "175967125"}},
      {"://image/item3_Legend8.png",
       "★ Driver Gloves | Imperial Plaid",
       "Водительские перчатки: Имперская клетка",
       {"166372", "100352", "44300", "42190", "31022"},
       {"176005968", "175967477", "175967060", "175967269", "175966959"}},
      {"://image/item3_Legend9.png", "★ Hand Wraps | Duct Tape", "Обмотки рук: Скотч", {"52438", "16104", "12949", "12302", "12060"}, {"175982378", "175966962", "175966997", "175966903", "175967400"}},
      {"://image/item3_Legend10.png",
       "★ Hand Wraps | Cobalt Skulls",
       "Обмотки рук: Синие черепа",
       {"209750", "136208", "57050", "49636", "58896"},
       {"176000052", "175967394", "175967070", "175968402", "175967376"}},
      {"://image/item3_Legend11.png",
       "★ Hand Wraps | Overprint",
       "Обмотки рук: Оттиск",
       {"142223", "44584", "28585", "27792", "17148"},
       {"176035092", "175967859", "175967236", "175967524", "175967256"}},
      {"://image/item3_Legend12.png", "★ Hand Wraps | Arboreal", "Обмотки рук: Лес", {"35610", "18898", "15074", "14143", "11810"}, {"175973542", "175967002", "175967046", "175967080", "175966998"}},
      {"://image/item3_Legend13.png",
       "★ Moto Gloves | Transport",
       "Мотоциклетные перчатки: Транспорт",
       {"72362", "21605", "13500", "11896", "10681"},
       {"175989462", "175967110", "175966856", "175967708", "175967292"}},
      {"://image/item3_Legend14.png",
       "★ Moto Gloves | Polygon",
       "Мотоциклетные перчатки: Полигон",
       {"161858", "42212", "26711", "24478", "16781"},
       {"175994037", "175967238", "175967083", "175967101", "175967547"}},
      {"://image/item3_Legend15.png",
       "★ Moto Gloves | POW!",
       "Мотоциклетные перчатки: БУХ!",
       {"153444", "85804", "27792", "21332", "15108"},
       {"176033534", "175967164", "175967006", "175970224", "175967799"}},
      {"://image/item3_Legend16.png",
       "★ Moto Gloves | Turtle",
       "Мотоциклетные перчатки: Черепаха",
       {"161858", "35610", "18420", "16643", "15634"},
       {"175984358", "175967252", "175967121", "175967103", "175967363"}},
      {"://image/item3_Legend17.png",
       "★ Specialist Gloves | Fade",
       "Перчатки спецназа: Градиент",
       {"209750", "161858", "51448", "47262", "25741"},
       {"175977080", "175967502", "175967208", "175967086", "175967320"}},
      {"://image/item3_Legend18.png",
       "★ Specialist Gloves | Buckshot",
       "Перчатки спецназа: Дробь",
       {"52982", "19147", "13056", "12657", "11898"},
       {"175981069", "175967184", "175967130", "175967661", "175967310"}},
      {"://image/item3_Legend19.png",
       "★ Specialist Gloves | Crimson Web",
       "Перчатки спецназа: Кровавая паутина",
       {"203533", "96484", "35082", "31643", "22022"},
       {"176000209", "175968453", "175966964", "175968939", "175967417"}},
      {"://image/item3_Legend20.png",
       "★ Specialist Gloves | Mogul",
       "Перчатки спецназа: Покоритель гор",
       {"115363", "44294", "23739", "21829", "19193"},
       {"175978332", "175967826", "175966912", "175967644", "175967127"}},
      {"://image/item3_Legend21.png",
       "★ Sport Gloves | Bronze Morph",
       "Спортивные перчатки: Окисление бронзы",
       {"188775", "32114", "19899", "18422", "16510"},
       {"175974178", "175967819", "175967029", "175967273", "175966977"}},
      {"://image/item3_Legend22.png",
       "★ Sport Gloves | Amphibious",
       "Спортивные перчатки: Амфибия",
       {"209750", "183539", "101205", "96000", "66362"},
       {"176075928", "175967031", "175967048", "175968724", "175967410"}},
      {"://image/item3_Legend23.png",
       "★ Sport Gloves | Vice",
       "Спортивные перчатки: Порок",
       {"211829", "221673", "165179", "116259", "73412"},
       {"175977476", "175967726", "175967265", "175968749", "175968446"}},
      {"://image/item3_Legend24.png",
       "★ Sport Gloves | Omega",
       "Спортивные перчатки: Омега",
       {"213023", "157313", "59144", "49671", "33985"},
       {"175981589", "175967418", "175967192", "175969277", "175967114"}}};
};

#endif // MAZEWINDOW_H
